sample/app/controllers/messages_controller.rb

INSERT INTO "messages" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "testes"], ["body", "test"], ["created_at", "2015-10-23 15:46:39.870611"], ["updated_at", "2015-10-23 15:46:39.870611"]]
---
	def create
		@message = Message.new(params.require(:message).permit(:title, :body))
		if @message.save