sample/app/views/messages/index.html.erb

SELECT "messages".* FROM "messages"  ORDER BY "messages"."created_at" DESC
---
	<% if @message.errors.any? %>
		<% @message.errors.full_messages.each do |err| %>